{
  "\t": 77,
  "\n": 16,
  "\r": 15,
  " ": 0,
  "!": 111,
  "\"": 72,
  "%": 123,
  "&": 105,
  "'": 46,
  "(": 43,
  ")": 44,
  "*": 131,
  "+": 151,
  ",": 18,
  "-": 28,
  ".": 24,
  "/": 142,
  "0": 50,
  "1": 38,
  "2": 41,
  "3": 48,
  "4": 53,
  "5": 51,
  "6": 54,
  "7": 55,
  "8": 60,
  "9": 66,
  ":": 76,
  ";": 31,
  "=": 125,
  "?": 91,
  "@": 154,
  "A": 32,
  "B": 47,
  "C": 42,
  "D": 62,
  "E": 52,
  "F": 63,
  "G": 70,
  "H": 40,
  "I": 30,
  "J": 83,
  "K": 64,
  "L": 65,
  "M": 45,
  "N": 61,
  "O": 69,
  "P": 39,
  "Q": 100,
  "R": 57,
  "S": 37,
  "T": 27,
  "U": 87,
  "V": 67,
  "W": 56,
  "X": 110,
  "Y": 79,
  "Z": 97,
  "[": 35,
  "]": 36,
  "^": 181,
  "_": 29,
  "a": 3,
  "b": 23,
  "c": 13,
  "d": 10,
  "e": 1,
  "f": 14,
  "g": 19,
  "h": 8,
  "i": 7,
  "j": 59,
  "k": 26,
  "l": 11,
  "m": 17,
  "n": 6,
  "o": 4,
  "p": 21,
  "q": 49,
  "r": 9,
  "s": 5,
  "t": 2,
  "u": 12,
  "v": 25,
  "w": 20,
  "x": 34,
  "y": 22,
  "z": 58,
  "{": 155,
  "\u009c": 112,
  "\u00a7": 173,
  "\u00a9": 177,
  "\u00ad": 141,
  "\u00b0": 116,
  "\u00c2": 107,
  "\u00c6": 106,
  "\u00c7": 96,
  "\u00c9": 150,
  "\u00ca": 135,
  "\u00d4": 185,
  "\u00d6": 143,
  "\u00dc": 153,
  "\u00e0": 121,
  "\u00e1": 102,
  "\u00e2": 33,
  "\u00e4": 103,
  "\u00e6": 84,
  "\u00e7": 68,
  "\u00e8": 115,
  "\u00e9": 98,
  "\u00ea": 93,
  "\u00eb": 124,
  "\u00ed": 120,
  "\u00ee": 81,
  "\u00ef": 139,
  "\u00f1": 101,
  "\u00f2": 152,
  "\u00f3": 113,
  "\u00f4": 99,
  "\u00f6": 109,
  "\u00f9": 136,
  "\u00fa": 128,
  "\u00fb": 90,
  "\u00fc": 94,
  "\u00fd": 184,
  "\u0101": 175,
  "\u0103": 118,
  "\u0106": 122,
  "\u0107": 82,
  "\u0115": 133,
  "\u0121": 129,
  "\u012b": 176,
  "\u0144": 108,
  "\u014d": 156,
  "\u0152": 134,
  "\u0153": 104,
  "\u016d": 174,
  "\u01f4": 127,
  "\u01f5": 88,
  "\u0303": 130,
  "\u039a": 182,
  "\u03ac": 160,
  "\u03b1": 147,
  "\u03b4": 144,
  "\u03b5": 145,
  "\u03b8": 163,
  "\u03b9": 157,
  "\u03ba": 161,
  "\u03bd": 132,
  "\u03bf": 149,
  "\u03c1": 146,
  "\u03c2": 138,
  "\u03c4": 148,
  "\u03c5": 183,
  "\u03c9": 162,
  "\u03cc": 158,
  "\u0627": 140,
  "\u062c": 172,
  "\u062f": 166,
  "\u0631": 169,
  "\u0645": 168,
  "\u0646": 171,
  "\u0647": 167,
  "\u0698": 165,
  "\u06af": 170,
  "\u1e0d": 117,
  "\u1e25": 86,
  "\u1e37": 126,
  "\u1e41": 89,
  "\u1e43": 137,
  "\u1e45": 114,
  "\u1e47": 78,
  "\u1e5a": 80,
  "\u1e5b": 85,
  "\u1e6d": 95,
  "\u1ecb": 180,
  "\u1fe6": 164,
  "\u2013": 178,
  "\u2014": 74,
  "\u2018": 92,
  "\u2019": 73,
  "\u201c": 71,
  "\u201d": 75,
  "\u2026": 179,
  "\u2032": 119,
  "\u2158": 159
}